<template>
    <top-banner :title="title" :backgroundImage="bannerUrl"></top-banner>
    <div class="main">
        <div class="content">
            <div class="map">
                <div class="left">
                    <img src="@/assets/images/about/pic_map@2x-1024x659.png" alt="">
                </div>
                <div class="right">
                    <div class="right-desc">
                        <ul class="desc-list">
                            <li class="item">
                                <svg t="1700720295624" class="icon" viewBox="0 0 1024 1024" version="1.1"
                                    xmlns="http://www.w3.org/2000/svg" p-id="962" width="200" height="200">
                                    <path
                                        d="M504.4272 0.064l20.096 0.128C763.7552 8.32 954.6672 190.208 959.9792 414.912c1.472 96.576-36.48 172.096-93.568 255.744l-1.792 2.368-254.848 306.752A127.232 127.232 0 0 1 512.3632 1024a127.232 127.232 0 0 1-97.344-44.224l-256.576-308.736C95.7232 581.632 63.9792 497.344 63.9792 420.672 63.9792 307.072 112.8752 198.4 199.6592 119.104 286.3792 39.936 403.5632-3.008 524.5232 0.192zM511.9792 256a192 192 0 1 0 0 384 192 192 0 0 0 0-384z"
                                        fill="#414141" p-id="963"></path>
                                </svg>
                                <p>宁波市鄞州区首南街道学士路536号 金东大厦15-19层</p>
                            </li>
                            <li class="item">
                                <svg t="1700720337655" class="icon" viewBox="0 0 1024 1024" version="1.1"
                                    xmlns="http://www.w3.org/2000/svg" p-id="1104" width="200" height="200">
                                    <path
                                        d="M999.61616 774.493118c40.227709 48.346393 21.942387 121.487682 8.045542 135.677093-13.896845 14.481975-12.946008 21.357257-79.650865 81.918244-67.070563 60.999836-201.28483 19.236159-262.211524 0-60.999836-19.382442-226.591716-125.291029-379.749577-270.915337C130.917061 573.720277 50.681066 389.916216 17.840626 290.078355c-32.767298-100.203567-12.287737-136.335364 0-170.12664C30.055222 86.087298 52.509598 57.342771 118.99503 19.236159c66.33915-38.252895 90.329493-9.142661 107.371414 0 17.041921 8.996379 91.28033 73.945844 117.026063 135.384528 25.599451 61.438683 13.457997 100.93498-6.363292 119.586009-19.748148 18.651029-33.791276 35.692949-50.101783 47.249273-16.383649 11.410041-19.748148 27.866831-17.334486 59.756434 2.26738 31.889602 117.464911 156.52236 140.211853 179.488725 22.6738 23.039506 172.613444 178.245323 224.690042 190.167353 52.14974 11.702606 70.947051-10.971193 76.652072-17.115061 5.705021-6.070727 26.184582-34.0107 49.443512-53.393142 23.405213-19.309301 85.721592-14.043128 101.154403-3.145075 15.359671 10.824911 97.570481 48.712099 137.871332 97.277915z"
                                        fill="#414141" p-id="1105"></path>
                                </svg>
                                <p>400-835-8800</p>
                            </li>
                            <li class="item">
                                <svg t="1700720362669" class="icon" viewBox="0 0 1303 1024" version="1.1"
                                    xmlns="http://www.w3.org/2000/svg" p-id="1246" width="200" height="200">
                                    <path
                                        d="M1303.272727 289.047273V845.265455C1303.272727 943.941818 1219.956364 1024 1117.090909 1024H186.181818c-102.865455 0-186.181818-80.058182-186.181818-178.827636V298.542545l613.655273 340.247273c21.131636 11.636364 46.545455 9.495273 64.884363-3.537454l2.420364-1.303273L1303.272727 289.047273zM1117.090909 0c95.604364 0 174.452364 69.073455 184.971636 158.254545L643.072 523.543273 0.558545 167.191273C6.702545 73.914182 87.505455 0 186.181818 0h930.722909z"
                                        fill="#414141" p-id="1247"></path>
                                </svg>
                                <p>marketing@lecangs.com</p>
                            </li>
                        </ul>
                    </div>
                    <div class="search">
                        <a href="https://map.baidu.com/poi/%E9%87%91%E4%B8%9C%E5%A4%A7%E5%8E%A6/@13532373.097203426,3458438.214827546,18.77z?uid=c46349b5303631f3260bd091&info_merge=1&isBizPoi=false&ugc_type=3&ugc_ver=1&device_ratio=1&compat=1&pcevaname=pc4.1&newfrom=zhuzhan_webmap&querytype=detailConInfo&da_src=shareurl"
                            class="search-buttom">
                            <span>查看路线</span>
                        </a>
                    </div>
                </div>
            </div>
            <div class="map-mobile">
                <img src="@/assets/images/about/pic_map@3x.png" alt="">
                <div class="search-mobile">
                    <a href="https://map.baidu.com/poi/%E9%87%91%E4%B8%9C%E5%A4%A7%E5%8E%A6/@13532373.097203426,3458438.214827546,18.77z?uid=c46349b5303631f3260bd091&info_merge=1&isBizPoi=false&ugc_type=3&ugc_ver=1&device_ratio=1&compat=1&pcevaname=pc4.1&newfrom=zhuzhan_webmap&querytype=detailConInfo&da_src=shareurl"
                        class="search-buttom">
                        <span>查看路线</span>
                    </a>
                </div>
            </div>
            <div class="qrcode">
                <ul class="code-list">
                    <li class="list-item">
                        <img src="@/assets/images/about/pic_lecang@2x-150x150.png" alt="">
                        <div class="desc">
                            <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" class="icon"
                                viewBox="0 0 1280 1024" width="250" height="200">
                                <path
                                    d="M880.213333 342.613333c193.578667 0 364.885333 139.605333 364.885334 310.869334 0 94.976-63.317333 180.608-150.826667 245.76l31.658667 107.989333-117.290667-65.152c-42.837333 11.178667-85.632 22.357333-128.426667 22.357333-204.8 0-364.970667-139.648-364.970666-310.954666 0-171.264 160.128-310.912 364.928-310.912zM464.938667 16.725333c210.389333 0 396.586667 128.426667 433.792 301.610667-13.013333-1.877333-27.904-1.877333-40.96-1.877333-204.8 0-364.885333 152.661333-364.885334 340.736 0 31.616 5.546667 61.44 13.013334 89.344-14.890667 0-27.904 1.877333-40.96 1.877333-53.973333 0-96.810667-11.178667-150.784-22.357333l-150.826667 74.496 42.837333-128.469334C98.218667 597.632 34.901333 500.821333 34.901333 381.653333c0-204.8 193.621333-364.885333 430.08-364.885333z m539.946666 497.066667a46.506667 46.506667 0 1 0 0 93.098667 46.506667 46.506667 0 0 0 0-93.056z m-236.458666-3.712a46.506667 46.506667 0 1 0 0 93.098667 46.506667 46.506667 0 0 0 0-93.098667zM321.621333 191.786667a66.986667 66.986667 0 1 0 0 134.016 66.986667 66.986667 0 0 0 0-134.016z m299.776-1.877334a66.986667 66.986667 0 1 0 0 134.058667 66.986667 66.986667 0 0 0 0-134.058667z"
                                    fill="#FFFFFF"></path>
                            </svg>
                            <p>乐仓官方微信公众号</p>
                        </div>
                    </li>
                    <li class="list-item">
                        <img src="@/assets/images/about/pic_weibo@2x-150x150.png" alt="">
                        <div class="desc">
                            <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" class="icon"
                                viewBox="0 0 1244 1024" width="242.96875" height="200">
                                <path
                                    d="M608.761521 294.845942c-9.73485 50.407854-25.248379 79.523502 38.761596 60.098253 0 0 168.781854-79.523502 238.614957-9.690399 56.230984 56.275435 9.690399 135.798937 9.690399 135.798937s-23.292518 25.203927 25.203927 34.894326c44.629176 7.77899 195.897191 77.612093 112.461968 256.039896-83.34632 178.472253-356.855604 265.730294-558.575924 250.261216-192.029921-15.55798-440.335278-79.567954-465.539205-316.182599 0 0-13.602119-106.68329 89.213901-244.438088 0 0 147.445197-207.54345 318.13846-267.641702 172.604672-58.231296 192.029921 40.717456 192.029921 100.86016z m246.305045 385.971251c-1.911409-133.798626-164.870134-219.145257-364.634593-209.454858-201.72032 9.690399-364.679045 118.285097-364.679045 254.084034s162.958725 238.570506 364.679045 228.924559c201.72032-9.779302 364.634594-137.799249 364.634593-273.553735z m-407.307909-118.285097c203.67618-25.248379 240.481915 170.693263 178.427802 252.128174-62.054113 81.479362-184.250931 120.285409-302.58048 54.319575-51.56359-28.448877-54.230672-81.346008-54.319575-89.969574v-1.422444c-0.800125-7.245573-19.291895-192.252178 178.472253-215.055731z m-45.38485 148.956543l-6.978865 0.400062c-38.806047 3.867269-64.009974 36.850186-64.009974 69.788652 0 31.071508 31.027057 54.319575 67.877243 50.452306 36.850186-3.867269 67.877243-32.982917 67.877243-65.965834 0-32.938466-29.071196-58.186844-71.744512-54.275124z m124.908352-22.892456c-5.82313-11.646259-21.336658-13.602119-36.894638-3.867269a28.448877 28.448877 0 0 0-7.734538 38.761595c5.82313 11.646259 23.292518 13.602119 34.938777 3.911721 11.601808-9.73485 17.424937-27.159787 9.690399-38.806047zM990.821052 54.230672c129.975808 31.071508 304.491889 174.604984 226.924248 440.335278-5.778678 38.806047-25.203927 23.292518-46.540585 23.292518-27.115336 0-48.451994-34.938777-48.451994-62.054113 0-23.292518 9.645947-46.585036 9.645947-46.585037 1.95586-9.690399 25.248379-71.744512-15.513528-162.914273-73.700373-126.108539-221.101118-126.108539-238.570507-120.285409-17.469389 7.77899-44.629176 11.646259-44.629176 11.646259-27.115336 0-48.451994-21.336658-48.451994-48.451994 0-23.292518 15.513528-40.761907 34.894326-46.585037 0 0 0 1.95586 1.95586 1.955861 1.911409 0 3.867269 1.911409 3.86727 1.911409 21.336658-3.867269 95.037031-9.690399 164.870133 7.77899zM1049.052348 399.617822v3.86727a33.516333 33.516333 0 0 1-32.982917 29.115647 32.671757 32.671757 0 0 1-32.982917-32.982917c0-3.867269 32.982917-153.223875-116.373689-120.240957a34.005299 34.005299 0 0 1-32.982917-32.982917c0-19.425249 15.55798-32.982917 32.982917-32.982917 0 0 207.587901-38.806047 182.339523 186.251243z"
                                    fill="#FFFFFF"></path>
                            </svg>
                            <p>乐歌微博公众号</p>
                        </div>
                    </li>
                    <li class="list-item">
                        <img src="@/assets/images/about/pic_douyin.png" alt="">
                        <div class="desc">
                            <p>乐仓官方抖音号</p>
                        </div>
                    </li>
                </ul>
            </div>
        </div>
    </div>
</template>
<script setup>
import { ref, } from 'vue'

const title = ref('关于乐仓')
const bannerUrl = ref('src/assets/images/about/pic_guanyu.png')
</script>
<style scoped>
.main {
    background: url(@/assets/images/about/pic_bg_map.png) no-repeat center;
    background-size: cover;
}

.content {
    font-weight: bold;
    color: #FFFFFF;
    text-align: center;
    padding-bottom: 220px;
}

.map {
    margin: 65px auto 120px;
    background: #f4f4f4;
    max-width: 1140px;
    display: flex;
    justify-content: space-between;
}

.map .left {
    padding: 10px;
}

.map .left img {
    width: 100%;
    height: 100%;
    vertical-align: middle;
}

.map .right {
    background: #fff;
    margin: 10px 10px 10px 0;
    padding: 60px 20px 32px 20px;
}

.desc-list li {
    display: flex;
    margin-bottom: 33px;
}

.desc-list li svg {
    height: 21px;
    width: 21px;
    margin-right: 10px;
}

.desc-list li p {
    font-size: 14px;
    font-weight: 500;
    color: #54595f;
    line-height: 21px;
    margin: 0;
    text-align: left;
}

.search {
    width: 167px;
    margin-top: 200px;
    background: #cd3938;
    border-radius: 0px 0px 0px 0px;
}

.search .search-buttom {
    display: inline-block;
    line-height: 1;
    font-size: 15px;
    color: #fff;
    padding: 12px 24px;
    text-align: center;
}

.qrcode .code-list {
    display: flex;
    justify-content: center;

}

.qrcode .code-list li {
    margin-right: 101px;
}

.qrcode .code-list li img {
    height: 150px;
}

.qrcode .code-list li:last-child {
    margin-right: 0;
}

.qrcode .code-list li .desc svg {
    height: 23px;
    width: 38px
}

.qrcode .code-list li .desc {
    display: flex;
    align-items: center;
    justify-content: center;
    margin-top: 12px;
    font-size: 13px;
    font-family: SourceHanSansCN-Regular, SourceHanSansCN;
    font-weight: 400;
    color: #fff;
    line-height: 19px;
}

.map-mobile {
    display: none;
}

@media screen and (max-width: 750px) {
    .map {
        display: none;
    }
    .map-mobile {
        display: block;
    }
    .map-mobile img {
        width: 100%;
        height: 100%;
    }
    .map-mobile .search-mobile {
        width: 1613px;
        height: 123px;
        background: #e02329;
        backdrop-filter: blur(0px);
        margin: 61px auto 72px;
    }
    .map-mobile .search-buttom {
        display: flex;
        justify-content: center;
        align-items: center;
        font-size: 82px;
        color: #fff;
        font-weight: 400;
        font-family: SourceHanSansCN-Regular, SourceHanSansCN;
        line-height: 123px;
    }
}</style>